story_backend/app/controllers/api/v1/doodles_controller.rb

  def index
    render json: Doodle.all
---
SELECT "doodles".* FROM "doodles"