story_backend/app/controllers/api/v1/posts_controller.rb

INSERT INTO "posts" ("story_id", "content", "prev_post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["story_id", 1], ["content", "who went into a house"], ["prev_post_id", 1], ["created_at", "2018-10-22 20:27:38.280415"], ["updated_at", "2018-10-22 20:27:38.280415"]]
---
  def create
    @post.create(post_params)

INSERT INTO "posts" ("story_id", "content", "prev_post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["story_id", 1], ["content", "she sat in a chair"], ["prev_post_id", 1], ["created_at", "2018-10-22 20:40:50.467454"], ["updated_at", "2018-10-22 20:40:50.467454"]]
UPDATE "posts" SET "next_post_ids" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["next_post_ids", "[9]"], ["updated_at", "2018-10-23 14:49:57.211346"], ["id", 2]]
---
  def update
    if @post.save
      @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_post
    @post = Post.find(params[:id])