story_backend/app/controllers/api/v1/stories_controller.rb

  def index
    @stories = Story.all
---
SELECT "stories".* FROM "stories"

  def create
    render json: Story.create(story_params)
---
INSERT INTO "stories" ("title", "doodle_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Bird"], ["doodle_id", 32], ["created_at", "2018-10-24 17:57:55.871481"], ["updated_at", "2018-10-24 17:57:55.871481"]]

  def find_story
    @story = Story.find(params[:id])
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]